---
kind: property
id: P:Autodesk.Revit.DB.ViewDisplayModel.ShowHiddenLines
source: html/19b845f3-44cf-328a-c6ff-27abcb4fe396.htm
---
# Autodesk.Revit.DB.ViewDisplayModel.ShowHiddenLines Property

True to enable hidden lines. False to disable showing them.

## Syntax (C#)
```csharp
public ShowHiddenLinesValues ShowHiddenLines { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration